# VertexType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeVertex..::..VertexType Property
SlabShapeVertex Class See Also
---
The type of the vertex.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SlabShapeVertexType VertexType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property VertexType As SlabShapeVertexType
	Get
```

Visual C++
---
```text
public:
property SlabShapeVertexType VertexType {
	SlabShapeVertexType get ();
}
```

# See Also
SlabShapeVertex Class
Autodesk.Revit.DB Namespace